1280. Students and Examinations

In [2]:
import pandas as pd

In [3]:
data = [[1, 'Alice'], [2, 'Bob'], [13, 'John'], [6, 'Alex']]
students = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [['Math'], ['Physics'], ['Programming']]
subjects = pd.DataFrame(data, columns=['subject_name']).astype({'subject_name':'object'})
data = [[1, 'Math'], [1, 'Physics'], [1, 'Programming'], [2, 'Programming'], [1, 'Physics'], [1, 'Math'], [13, 'Math'], [13, 'Programming'], [13, 'Physics'], [2, 'Math'], [1, 'Math']]
examinations = pd.DataFrame(data, columns=['student_id', 'subject_name']).astype({'student_id':'Int64', 'subject_name':'object'})

In [4]:
students

   student_id student_name
0           1        Alice
1           2          Bob
2          13         John
3           6         Alex

In [5]:
subjects

  subject_name
0         Math
1      Physics
2  Programming

In [6]:
examinations

    student_id subject_name
0            1         Math
1            1      Physics
2            1  Programming
3            2  Programming
4            1      Physics
5            1         Math
6           13         Math
7           13  Programming
8           13      Physics
9            2         Math
10           1         Math

In [7]:
exam_subject = pd.merge(examinations, subjects, on='subject_name')

In [8]:
from tomlkit import key


complete_table = pd.merge(students.assign(key=0), subjects.assign(key=0), on='key').drop('key', axis=1)

In [10]:
attendance_count = exam_subject.groupby(['student_id', 'subject_name']).size().reset_index(name='attended_exams')

In [12]:
attendance_count['attended_exams'] = attendance_count['attended_exams'].fillna(0).astype(int)

In [11]:
final_result = pd.merge(complete_table, attendance_count, on=['student_id', 'subject_name'], how='left')

In [12]:
final_result['attended_exams'] = final_result['attended_exams'].fillna(0).astype(int)

In [13]:
final_result = final_result.sort_values(by=['student_id', 'subject_name']).reset_index(drop=True)

In [16]:
final_result

    student_id student_name subject_name  attended_exams
0            1        Alice         Math               3
1            1        Alice      Physics               2
2            1        Alice  Programming               1
3            2          Bob         Math               1
4            2          Bob      Physics               0
5            2          Bob  Programming               1
6            6         Alex         Math               0
7            6         Alex      Physics               0
8            6         Alex  Programming               0
9           13         John         Math               1
10          13         John      Physics               1
11          13         John  Programming               1